espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_syscfg.h
/** @} End of group EFR32MG24_SYSCFG */

/**************************************************************************//**
 * @addtogroup EFR32MG24_SYSCFG
 * @{
 * @defgroup EFR32MG24_SYSCFG_BitFields SYSCFG Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for SYSCFG IPVERSION */
#define _SYSCFG_IPVERSION_RESETVALUE                          0x00000003UL                               /**< Default value for SYSCFG_IPVERSION          */
#define _SYSCFG_IPVERSION_MASK                                0xFFFFFFFFUL                               /**< Mask for SYSCFG_IPVERSION                   */
#define _SYSCFG_IPVERSION_IPVERSION_SHIFT                     0                                          /**< Shift value for SYSCFG_IPVERSION            */
#define _SYSCFG_IPVERSION_IPVERSION_MASK                      0xFFFFFFFFUL                               /**< Bit mask for SYSCFG_IPVERSION               */
#define _SYSCFG_IPVERSION_IPVERSION_DEFAULT                   0x00000003UL                               /**< Mode DEFAULT for SYSCFG_IPVERSION           */
#define SYSCFG_IPVERSION_IPVERSION_DEFAULT                    (_SYSCFG_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for SYSCFG_IPVERSION   */

/* Bit fields for SYSCFG IF */
#define _SYSCFG_IF_RESETVALUE                                 0x00000000UL                              /**< Default value for SYSCFG_IF                 */
#define _SYSCFG_IF_MASK                                       0x33033F0FUL                              /**< Mask for SYSCFG_IF                          */
#define SYSCFG_IF_SW0                                         (0x1UL << 0)                              /**< Software Interrupt Flag                     */
#define _SYSCFG_IF_SW0_SHIFT                                  0                                         /**< Shift value for SYSCFG_SW0                  */
#define _SYSCFG_IF_SW0_MASK                                   0x1UL                                     /**< Bit mask for SYSCFG_SW0                     */
#define _SYSCFG_IF_SW0_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SW0_DEFAULT                                 (_SYSCFG_IF_SW0_DEFAULT << 0)             /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SW1                                         (0x1UL << 1)                              /**< Software Interrupt Flag                     */
#define _SYSCFG_IF_SW1_SHIFT                                  1                                         /**< Shift value for SYSCFG_SW1                  */
#define _SYSCFG_IF_SW1_MASK                                   0x2UL                                     /**< Bit mask for SYSCFG_SW1                     */
#define _SYSCFG_IF_SW1_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SW1_DEFAULT                                 (_SYSCFG_IF_SW1_DEFAULT << 1)             /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SW2                                         (0x1UL << 2)                              /**< Software Interrupt Flag                     */
#define _SYSCFG_IF_SW2_SHIFT                                  2                                         /**< Shift value for SYSCFG_SW2                  */
#define _SYSCFG_IF_SW2_MASK                                   0x4UL                                     /**< Bit mask for SYSCFG_SW2                     */
#define _SYSCFG_IF_SW2_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SW2_DEFAULT                                 (_SYSCFG_IF_SW2_DEFAULT << 2)             /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SW3                                         (0x1UL << 3)                              /**< Software Interrupt Flag                     */
#define _SYSCFG_IF_SW3_SHIFT                                  3                                         /**< Shift value for SYSCFG_SW3                  */
#define _SYSCFG_IF_SW3_MASK                                   0x8UL                                     /**< Bit mask for SYSCFG_SW3                     */
#define _SYSCFG_IF_SW3_DEFAULT                                0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SW3_DEFAULT                                 (_SYSCFG_IF_SW3_DEFAULT << 3)             /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPIOC                                       (0x1UL << 8)                              /**< FPU Invalid Operation interrupt flag        */
#define _SYSCFG_IF_FPIOC_SHIFT                                8                                         /**< Shift value for SYSCFG_FPIOC                */
#define _SYSCFG_IF_FPIOC_MASK                                 0x100UL                                   /**< Bit mask for SYSCFG_FPIOC                   */
#define _SYSCFG_IF_FPIOC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPIOC_DEFAULT                               (_SYSCFG_IF_FPIOC_DEFAULT << 8)           /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPDZC                                       (0x1UL << 9)                              /**< FPU Divide by zero interrupt flag           */
#define _SYSCFG_IF_FPDZC_SHIFT                                9                                         /**< Shift value for SYSCFG_FPDZC                */
#define _SYSCFG_IF_FPDZC_MASK                                 0x200UL                                   /**< Bit mask for SYSCFG_FPDZC                   */
#define _SYSCFG_IF_FPDZC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPDZC_DEFAULT                               (_SYSCFG_IF_FPDZC_DEFAULT << 9)           /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPUFC                                       (0x1UL << 10)                             /**< FPU Underflow interrupt flag                */
#define _SYSCFG_IF_FPUFC_SHIFT                                10                                        /**< Shift value for SYSCFG_FPUFC                */
#define _SYSCFG_IF_FPUFC_MASK                                 0x400UL                                   /**< Bit mask for SYSCFG_FPUFC                   */
#define _SYSCFG_IF_FPUFC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPUFC_DEFAULT                               (_SYSCFG_IF_FPUFC_DEFAULT << 10)          /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPOFC                                       (0x1UL << 11)                             /**< FPU Overflow interrupt flag                 */
#define _SYSCFG_IF_FPOFC_SHIFT                                11                                        /**< Shift value for SYSCFG_FPOFC                */
#define _SYSCFG_IF_FPOFC_MASK                                 0x800UL                                   /**< Bit mask for SYSCFG_FPOFC                   */
#define _SYSCFG_IF_FPOFC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPOFC_DEFAULT                               (_SYSCFG_IF_FPOFC_DEFAULT << 11)          /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPIDC                                       (0x1UL << 12)                             /**< FPU Input denormal interrupt flag           */
#define _SYSCFG_IF_FPIDC_SHIFT                                12                                        /**< Shift value for SYSCFG_FPIDC                */
#define _SYSCFG_IF_FPIDC_MASK                                 0x1000UL                                  /**< Bit mask for SYSCFG_FPIDC                   */
#define _SYSCFG_IF_FPIDC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPIDC_DEFAULT                               (_SYSCFG_IF_FPIDC_DEFAULT << 12)          /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FPIXC                                       (0x1UL << 13)                             /**< FPU Inexact interrupt flag                  */
#define _SYSCFG_IF_FPIXC_SHIFT                                13                                        /**< Shift value for SYSCFG_FPIXC                */
#define _SYSCFG_IF_FPIXC_MASK                                 0x2000UL                                  /**< Bit mask for SYSCFG_FPIXC                   */
#define _SYSCFG_IF_FPIXC_DEFAULT                              0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FPIXC_DEFAULT                               (_SYSCFG_IF_FPIXC_DEFAULT << 13)          /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_HOST2SRWBUSERR                              (0x1UL << 16)                             /**< HOST2SRWBUSERRIF Interrupt Flag             */
#define _SYSCFG_IF_HOST2SRWBUSERR_SHIFT                       16                                        /**< Shift value for SYSCFG_HOST2SRWBUSERR       */
#define _SYSCFG_IF_HOST2SRWBUSERR_MASK                        0x10000UL                                 /**< Bit mask for SYSCFG_HOST2SRWBUSERR          */
#define _SYSCFG_IF_HOST2SRWBUSERR_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_HOST2SRWBUSERR_DEFAULT                      (_SYSCFG_IF_HOST2SRWBUSERR_DEFAULT << 16) /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SRW2HOSTBUSERR                              (0x1UL << 17)                             /**< SRW2HOSTBUSERRIF Interrupt Flag             */
#define _SYSCFG_IF_SRW2HOSTBUSERR_SHIFT                       17                                        /**< Shift value for SYSCFG_SRW2HOSTBUSERR       */
#define _SYSCFG_IF_SRW2HOSTBUSERR_MASK                        0x20000UL                                 /**< Bit mask for SYSCFG_SRW2HOSTBUSERR          */
#define _SYSCFG_IF_SRW2HOSTBUSERR_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SRW2HOSTBUSERR_DEFAULT                      (_SYSCFG_IF_SRW2HOSTBUSERR_DEFAULT << 17) /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SEQRAMERR1B                                 (0x1UL << 24)                             /**< SEQRAM Error 1-bit Interrupt Flag           */
#define _SYSCFG_IF_SEQRAMERR1B_SHIFT                          24                                        /**< Shift value for SYSCFG_SEQRAMERR1B          */
#define _SYSCFG_IF_SEQRAMERR1B_MASK                           0x1000000UL                               /**< Bit mask for SYSCFG_SEQRAMERR1B             */
#define _SYSCFG_IF_SEQRAMERR1B_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SEQRAMERR1B_DEFAULT                         (_SYSCFG_IF_SEQRAMERR1B_DEFAULT << 24)    /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_SEQRAMERR2B                                 (0x1UL << 25)                             /**< SEQRAM Error 2-bit Interrupt Flag           */
#define _SYSCFG_IF_SEQRAMERR2B_SHIFT                          25                                        /**< Shift value for SYSCFG_SEQRAMERR2B          */
#define _SYSCFG_IF_SEQRAMERR2B_MASK                           0x2000000UL                               /**< Bit mask for SYSCFG_SEQRAMERR2B             */
#define _SYSCFG_IF_SEQRAMERR2B_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_SEQRAMERR2B_DEFAULT                         (_SYSCFG_IF_SEQRAMERR2B_DEFAULT << 25)    /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FRCRAMERR1B                                 (0x1UL << 28)                             /**< FRCRAM Error 1-bit Interrupt Flag           */
#define _SYSCFG_IF_FRCRAMERR1B_SHIFT                          28                                        /**< Shift value for SYSCFG_FRCRAMERR1B          */
#define _SYSCFG_IF_FRCRAMERR1B_MASK                           0x10000000UL                              /**< Bit mask for SYSCFG_FRCRAMERR1B             */
#define _SYSCFG_IF_FRCRAMERR1B_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FRCRAMERR1B_DEFAULT                         (_SYSCFG_IF_FRCRAMERR1B_DEFAULT << 28)    /**< Shifted mode DEFAULT for SYSCFG_IF          */
#define SYSCFG_IF_FRCRAMERR2B                                 (0x1UL << 29)                             /**< FRCRAM Error 2-bit Interrupt Flag           */
#define _SYSCFG_IF_FRCRAMERR2B_SHIFT                          29                                        /**< Shift value for SYSCFG_FRCRAMERR2B          */
#define _SYSCFG_IF_FRCRAMERR2B_MASK                           0x20000000UL                              /**< Bit mask for SYSCFG_FRCRAMERR2B             */
#define _SYSCFG_IF_FRCRAMERR2B_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for SYSCFG_IF                  */
#define SYSCFG_IF_FRCRAMERR2B_DEFAULT                         (_SYSCFG_IF_FRCRAMERR2B_DEFAULT << 29)    /**< Shifted mode DEFAULT for SYSCFG_IF          */

